# StructuralEndReleaseFy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralEndReleaseFy Property
ParameterTypeId Class See Also
---
"End Fy"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralEndReleaseFy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralEndReleaseFy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralEndReleaseFy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace